Revit 2026 API

# FabricationConfigurationSetServicesToLoad Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool SetServicesToLoad(
	IList<int> serviceIds
)
```
```vb
Public Function SetServicesToLoad (
	serviceIds As IList(Of Integer)
) As Boolean
```
```cpp
public:
bool SetServicesToLoad(
	IList<int>^ serviceIds
)
```
```fsharp
member SetServicesToLoad :
        serviceIds : IList<int> -> bool
```

#### Parameters

serviceIds IListInt32

#### Return Value

Boolean

#### Reference

FabricationConfiguration Class

Autodesk.Revit.DB Namespace